{
  "backend/main.mo": "Main backend actor implementing course enrollment system with role-based access control, managing students, marketers, and courses (basic, advanced, super) with user profiles and permissions.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: management team names in footer, WhatsApp contact in footer, and unique course images with high confidence test coverage.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, pages, hooks, and utilities for the midbrain activation course marketing application.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light/dark themes with warm orange/amber educational palette and base styling.",
  "frontend/index.html": "HTML entry point for the Midbrain Activation Course Marketing App with root div and module script loader.",
  "frontend/src/App.tsx": "Root application component managing authentication flow with Internet Identity, profile setup modal for new users, and role-based layout rendering with loading states.",
  "frontend/src/components/AllMarketersView.tsx": "Management dashboard component displaying marketer performance rankings, referral statistics, and top performer metrics in a sortable table with summary cards.",
  "frontend/src/components/CourseList.tsx": "Displays a grid of all available courses with enrollment functionality, showing course images, descriptions, and enrollment status with loading skeletons and empty states.",
  "frontend/src/components/CourseManagement.tsx": "Management view showing a table of all courses with enrollment statistics and active status badges, calculating enrollment counts per course from student data.",
  "frontend/src/components/EnrolledCourses.tsx": "Displays a grid of courses the current user is enrolled in with course images, descriptions, and active enrollment badges.",
  "frontend/src/components/EnrollmentAnalytics.tsx": "Dashboard component showing enrollment statistics with summary cards and charts (bar chart and pie chart) visualizing enrollment data across courses using Recharts.",
  "frontend/src/components/MarketerStats.tsx": "Profile management card for marketers allowing them to view and edit their name with inline editing functionality.",
  "frontend/src/components/Navigation.tsx": "Top navigation header displaying the app logo, user role, username, and logout button with role-based portal labeling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to set up their profile by entering their name and selecting a role (Student, Management, or Marketer).",
  "frontend/src/components/RoleBasedLayout.tsx": "Layout component that renders role-specific dashboards (Student, Management, or Marketer) based on user profile, with a navigation header and footer containing contact information and attribution.",
  "frontend/src/components/StudentList.tsx": "Displays a searchable table of all enrolled students with their course enrollments, showing student names, enrolled courses as badges, and total enrollment counts.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing AuthClient lifecycle and identity state with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, courses, students, and marketers, with mutations that show toast notifications and invalidate relevant queries on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming (light and dark modes) using an orange-based color scheme for the Midbrain Academy application.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/ManagementDashboard.tsx": "Management dashboard displaying overview statistics (courses, students, enrollments, referrals) and tabbed views for analytics, course management, student lists, and marketer performance.",
  "frontend/src/pages/MarketerDashboard.tsx": "Marketer dashboard page displaying referral statistics (total referrals, performance status, marketer name) with a button to track new referrals and a MarketerStats component.",
  "frontend/src/pages/StudentDashboard.tsx": "Student dashboard page showing course statistics (available, enrolled, remaining courses) with tabs to switch between enrolled courses and available courses for enrollment.",
  "frontend/src/utils/courseImages.ts": "Utility function that maps course IDs (basic, advanced, super) to their corresponding image paths in the assets/generated folder.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting query parameters from both regular and hash-based routing, with sessionStorage persistence and cleanup functions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended border radius, Inter font family, custom shadows, and accordion animations.",
  "project_state.json": "Project state tracking for Midbrain Activation course app with three completed features: management team names in footer, WhatsApp contact, and course-specific images."
}