{
  "backend/main.mo": "Main actor defining the course management system with access control, student/marketer management, course enrollment, and student application submission. Includes predefined courses (basic, advanced, super, institution, meditation) with role-based authorization for management, students, and marketers.",
  "backend/migration.mo": "Migration module defining data types (Course, Student, Marketer, UserProfile, StudentApplication) and a run function that updates the courses map with the latest course definitions including the new meditation course for 18+ users.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: displaying updated course descriptions with duration details across all frontend views, and assigning unique images for the meditation course with consistent display.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components, hooks, utilities, and configuration files describing their functionality, including dashboards, course displays, authentication, and styling.",
  "frontend/index.css": "Global Tailwind CSS styles defining CSS custom properties for light and dark themes using OKLCH color system with warm orange/amber educational color palette and design tokens for UI components.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and root div mounting point, titled 'Midbrain Activation Course Marketing App'.",
  "frontend/src/App.tsx": "Root application component managing authentication flow with Internet Identity, showing PublicHomepage for unauthenticated users, ProfileSetupModal for new users, and RoleBasedLayout for authenticated users with profiles.",
  "frontend/src/components/AllMarketersView.tsx": "Management dashboard component displaying all marketers with performance rankings, referral statistics, summary cards showing total marketers/referrals/top performer, and sortable table with loading and empty states.",
  "frontend/src/components/CourseList.tsx": "Displays a grid of all available courses with enrollment status, course images, duration info, and 18+ badges. Allows authenticated users to enroll in courses via mutation hook.",
  "frontend/src/components/CourseManagement.tsx": "Admin component showing a table of all courses with enrollment counts and active/inactive status badges. Calculates enrollment statistics by filtering students enrolled in each course.",
  "frontend/src/components/EnrolledCourses.tsx": "Displays a grid of courses the current user is enrolled in, showing course images, duration info, and active status badges. Shows empty state if no enrollments exist.",
  "frontend/src/components/EnrollmentAnalytics.tsx": "Admin dashboard component displaying enrollment statistics with summary cards and charts (bar chart for enrollments by course, pie chart for distribution). Uses Recharts for data visualization.",
  "frontend/src/components/MarketerStats.tsx": "Marketer profile component allowing users to view and edit their marketer name. Fetches marketer stats and provides inline editing with save/cancel actions.",
  "frontend/src/components/Navigation.tsx": "Top navigation bar displaying the Midbrain Academy logo, user role, username, and logout button. Clears authentication and query cache on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal component for initial user profile setup that collects name and role (Student/Management/Marketer), with password validation for Management role using a hardcoded password.",
  "frontend/src/components/RoleBasedLayout.tsx": "Layout wrapper that renders role-specific dashboards (Student/Management/Marketer) with navigation and footer containing contact information and attribution to caffeine.ai.",
  "frontend/src/components/StudentApplicationForm.tsx": "Form component for student admission applications that collects student details (name, father name, city, age, contact, course selection, referral) and submits to backend with JSON-serialized contact info.",
  "frontend/src/components/StudentApplicationsView.tsx": "Management view displaying all student applications in a searchable table with summary cards showing total and pending applications, parsing JSON contact info for display.",
  "frontend/src/components/StudentList.tsx": "Management component displaying enrolled students with their course enrollments in a searchable table, showing course badges and enrollment counts.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control with admin token and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for all backend operations including user profiles, courses, students, marketers, and student applications with mutations for enrollment, updates, and referral tracking.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color schemes for UI components using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/ManagementDashboard.tsx": "Admin dashboard displaying overview statistics and tabbed interface for managing courses, students, marketers, analytics, and student applications with loading skeletons.",
  "frontend/src/pages/MarketerDashboard.tsx": "Marketer-specific dashboard showing referral statistics, performance metrics, and a button to track new referrals with loading states.",
  "frontend/src/pages/PublicHomepage.tsx": "Public landing page displaying four midbrain activation courses with details, hero banner, feature cards, and student application form for unauthenticated users.",
  "frontend/src/pages/StudentDashboard.tsx": "Student dashboard page displaying statistics (available, enrolled, remaining courses) and three tabs: enrolled courses, available courses, and application form. Uses custom hooks for data fetching and displays loading skeletons.",
  "frontend/src/utils/courseImages.ts": "Utility function that maps course IDs (basic, advanced, super, institution, meditation) to their corresponding image asset paths, with a fallback to the basic course image.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, custom border radius variables, Inter font family, custom shadows, and accordion animations. Includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state tracking file for Midbrain Academy showing pending feature requests to add a meditation course for 18+ age group and update course descriptions with duration details (3 days to 1 month depending on course level)."
}