{
  "backend/main.mo": "Main actor defining the course management system with access control, user roles (Student, Management, Marketer), and CRUD operations for courses, students, marketers, and student applications. Includes four predefined courses (basic, advanced, super, meditation) with the 'institution' course removed.",
  "backend/migration.mo": "Migration module that filters out the 'institution' course from the courses map during actor upgrades.",
  "feature_evidence.json": "Feature evidence report documenting the removal of the 'institution' course from courseImages utility and verification of its removal from all course listings.",
  "frontend-file-summaries.txt": "Pre-generated summaries of frontend components including dashboards, course management, authentication, and utility functions for the midbrain activation course marketing application.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining light and dark theme variables for a warm educational color palette with orange/amber tones.",
  "frontend/index.html": "HTML entry point for the Midbrain Activation Course Marketing App with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component managing authentication flow, showing PublicHomepage for unauthenticated users and RoleBasedLayout with ProfileSetupModal for authenticated users.",
  "frontend/src/components/AllMarketersView.tsx": "Management dashboard component displaying marketer performance statistics, rankings, and referral counts in a sortable table with summary cards.",
  "frontend/src/components/CourseList.tsx": "Component rendering available courses in a grid with images, enrollment status badges, age requirement indicators (18+), extracted duration/daily hours info, and enroll buttons.",
  "frontend/src/components/CourseManagement.tsx": "Displays a table of all courses with enrollment counts and status badges, fetching data from courses and students queries. Shows loading skeletons and empty states when appropriate.",
  "frontend/src/components/EnrolledCourses.tsx": "Shows a grid of course cards for courses the current user is enrolled in, displaying course images, descriptions, duration info, and 18+ badges. Includes loading and empty states.",
  "frontend/src/components/EnrollmentAnalytics.tsx": "Renders analytics dashboard with summary cards and charts (bar and pie) showing enrollment statistics across courses and students. Uses recharts for data visualization.",
  "frontend/src/components/MarketerStats.tsx": "Displays and allows editing of marketer profile name, fetching marketer stats by principal ID. Includes inline edit mode with save/cancel actions.",
  "frontend/src/components/Navigation.tsx": "Top navigation bar showing app logo, user role, username, and logout button. Clears query cache and identity on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for initial user profile setup requiring name and role selection, with password validation for Management role. Cannot be dismissed until completed.",
  "frontend/src/components/RoleBasedLayout.tsx": "Main layout wrapper that renders role-specific dashboards (Student, Management, or Marketer) with shared navigation header and footer containing contact info and attribution.",
  "frontend/src/components/StudentApplicationForm.tsx": "A form component for student applications that collects student details (name, father name, city, age, contact, course selection, referral) and submits them via a mutation hook, storing additional fields as JSON in contactInfo.",
  "frontend/src/components/StudentApplicationsView.tsx": "Displays all student applications in a table with search functionality, showing summary cards for total and pending applications, and parsing JSON contactInfo to display structured data.",
  "frontend/src/components/StudentList.tsx": "Shows a searchable table of all enrolled students with their course enrollments, displaying course badges and enrollment counts using data from student and course queries.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing AuthClient creation, identity persistence, and authentication status throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, courses, students, marketers, and student applications, with mutations that show toast notifications and invalidate relevant queries on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming (light and dark modes) using an orange/brown color palette, defining design tokens for backgrounds, borders, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider and InternetIdentity provider wrapping the main App component.",
  "frontend/src/pages/ManagementDashboard.tsx": "Admin dashboard displaying overview statistics (courses, students, enrollments, referrals, applications) and tabbed views for managing courses, students, marketers, analytics, and student applications.",
  "frontend/src/pages/MarketerDashboard.tsx": "Marketer-specific dashboard showing referral statistics, performance metrics, and a button to track new referrals with real-time updates.",
  "frontend/src/pages/PublicHomepage.tsx": "Public landing page displaying three midbrain activation courses (Basic, Advanced, Meditation) with hero section, feature cards, course details, and student application form for unauthenticated users.",
  "frontend/src/pages/StudentDashboard.tsx": "Student dashboard with statistics cards and three tabs: enrolled courses, available courses to browse, and application form submission.",
  "frontend/src/utils/courseImages.ts": "Utility function that maps course IDs (basic, advanced, super, meditation) to their corresponding image asset paths.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting query parameters from both regular and hash-based routing, with sessionStorage persistence and cleanup functions for managing parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including OKLCH color system with CSS variables, custom border radii, Inter font family, custom shadows, and accordion animations, along with typography, container queries, and animate plugins.",
  "project_state.json": "Project state tracking file for removing the 'institution' course, containing two completed features (removing course image mapping and verification) and two pending feature requests (removing from backend courses list and migration module)."
}