{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove Institutional Course",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Remove the 'institution' course image mapping from the courseImages utility function",
      "acceptanceCriteria": [
        "The courseImages.ts utility no longer includes a mapping for the 'institution' course ID"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/courseImages.ts",
          "operation": "modify",
          "description": "Remove the 'institution' case from the courseImages function. The function currently maps course IDs (basic, advanced, super, institution, meditation) to image paths. Delete the institution mapping entry so only basic, advanced, super, and meditation remain."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Verify that the institutional course no longer appears in any course listings on the public homepage, student dashboard, or management views",
      "acceptanceCriteria": [
        "The institutional course does not appear in the available courses list",
        "The institutional course does not appear in enrolled courses",
        "The institutional course is not available for selection in the student application form"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PublicHomepage.tsx",
          "operation": "modify",
          "description": "Review the public homepage to ensure it dynamically fetches courses from the backend via getAllCourses query hook. Since the backend will no longer return the institutional course, verify that the CourseList or course display logic does not hardcode the institutional course. No changes should be needed if the component already uses the backend data source."
        },
        {
          "path": "frontend/src/pages/StudentDashboard.tsx",
          "operation": "modify",
          "description": "Review the student dashboard to ensure enrolled courses and available courses tabs fetch data dynamically from backend hooks (getEnrolledCourses, getAllCourses). Verify that no hardcoded institutional course references exist. No changes should be needed if the component already uses the backend data source."
        },
        {
          "path": "frontend/src/components/StudentApplicationForm.tsx",
          "operation": "modify",
          "description": "Review the student application form to ensure the course selection dropdown populates from the getAllCourses backend query hook. Verify that the institutional course option will not appear once removed from the backend. Confirm no hardcoded institutional course option exists in the form."
        },
        {
          "path": "frontend/src/components/CourseManagement.tsx",
          "operation": "modify",
          "description": "Review the course management admin view to ensure it fetches courses dynamically via getAllCourses query hook and that the institutional course will no longer appear in the management table once removed from the backend. Verify no hardcoded institutional course references exist."
        }
      ]
    }
  ]
}